# Task #05 作業 02【實作題】集合元素合併

'''
#練習：請將不同的 dict 元素合併成一個 dict

❏ Requirements：

1. 初始化三個 dict 分別為 {1:10, 2:20}, {3:30, 4:40}, {5:50, 6:60}

2. 利用程式將三個 dict 的結果合併之後輸出

❏ Sample Input： {1:10, 2:20}, {3:30, 4:40}, {5:50, 6:60} ← 預設初始化

❏ Sample Output： {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60} ← 畫面輸出
'''

d1 = {1:10, 2:20}
d2 = {3:30, 4:40}
d3 = {5:50, 6:60}

# method1
d = {**d1, **d2, **d3}

print(d) # {1: 10, 2: 20, 3: 30, 4: 40, 5: 50, 6: 60}

# method2
d1.update(d2)
d1.update(d3)
print(d1)

# Task #05 作業 03【實作題】去除重複與排序
'''
#練習：請將列表中重複的元素移除並且將元素由大到小排列

❏ Requirements：

1. 在程式中初始化一個列表，其內容為 [1, 1, 3, 9, 7, 8, 8, 8]

2. 利用程式將列表中重複的元素移除

3. 最後請將剩餘元素由大至小排序後印出

❏ Sample Input： [1, 1, 3, 9, 7, 8, 8, 8] ← 預設初始化

❏ Sample Output： [9, 8, 7, 3, 1] ← 畫面輸出
'''

L = [1, 1, 3, 9, 7, 8, 8, 8]

L_set = set(L)
L = list(L_set)
L.sort(reverse=True)

print(L) # [9, 8, 7, 3, 1]